{
  "assets": [
  ],
  "characters": [
    {

    },{
        
    }
  ],
  "conversations": [
    {
      "id": "intro",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "Your journey takes you along a long meandering river.",
              "You’re glad to be by its side for its water which you can drink and take frequent baths in.",
              "You encounter several colourful birds by the trees along the banks.",
              "As you prepare to stop for the night beside a nice sandy spot, one flock of parrots comes down from a tree and warns you of caiman residing in the river.",
              "Never having seen one, you ask the parrots what it is.",
              "They explain it’s a large lizard-like reptile with large, sharp teeth which eats anything that goes near the river."
          ]
        }
      ],
      "options": [
          {
            "text": "Leave the area",
            "link": "outcome1"
          },
          {
            "text": "Stay the night",
            "link": "outcome2"
          }
      ]
    },
    {
      "id": "outcome1",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You decide the nice sandy spot isn’t worth risking your life for.",
              "As you try to find a spot away from the river, you see yellow eyes gleaming at you from the water.",
              "You hasten your pace to get out of the area as quickly as possible.",
              "Even after finding a better spot, your irrational fear of caimans keeps you awake all night.",
              "Lose some health."
          ],
          "triggers": [
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "health",
                "amount": -5
              }
            }
          ]
        }
      ]
    },
    {
      "id": "outcome2",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You decide to stay the night by the river.",
              "How much trouble can a large lizard cause anyways.",
              "Unfortunately for you, while trying to gather the herd the next morning, you count one less llama.",
              "Lose 1 llama."
          ],
          "triggers": [
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "herdSize",
                "amount": -1
              }
            }
          ]
        }
      ]
    }
  ]
}