{
  "assets": [
  ],
  "characters": [
    {

    },{
        
    }
  ],
  "conversations": [
    {
      "id": "intro",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "One night as you are resting, you witness a fellow llama sneaking off away from the rest.",
              "Deciding to follow cautiously, you soon hear the telltale sounds of munching and crunching as the llama pulls cookie after cookie from a secret stash and devours each one.",
              "Food is scarce in the wilderness, and the herd can't survive the selfishness of others.",
              "Do you overlook it or do you report him to the herd?"
          ]
        }
      ],
      "options": [
          {
            "text": "overlook",
            "link": "outcome1"
          },
          {
            "text": "report",
            "link": "outcome2"
          }
      ]
    },
    {
      "id": "outcome1",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You decide to mind your own business and keep what you just witnessed to yourself.",
              "The next day during a break, the cookie muncher from last night gets up on a rock to make an important announcement.",
              "He explains that lately, he's been taking up baking as a hobby.",
              "In fact, his passion for pastries has taken over his life so much that he will be leaving the herd to pursue his dreams in Culinary Arts School.",
              "Before he leaves, he throws a farewell party with cakes and goodies for everyone.",
              "With heavy hearts and full stomachs, the pack bids him farewell and wishes him luck in his future endeavours. (Health + 15, Herd Size - 1)"
          ],
          "triggers": [
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "health",
                "amount": 15
              }
            },
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "herdSize",
                "amount": -1
              }
            }
          ]
        }
      ]
    },
    {
      "id": "outcome2",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You present the greedy gobbler to the rest of the herd.",
              "He cries and beggs not to be kicked out of the herd, and even offers to take smaller meal portions for the following week.",
              "They feel bad for him and decide to forgive him, letting him stay. (Food + 15)"
          ],
          "triggers": [
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "food",
                "amount": 15
              }
            }
          ]
        }
      ]
    }
  ]
}

