{
  "assets": [
  ],
  "characters": [
    {

    },{
        
    }
  ],
  "conversations": [
    {
      "id": "intro",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You come across a big apple tree.",
              "The herd could use a nice treat with all the walking they've done today.",
              "You shake one of the low-hanging branches.",
              "A few fruits fall to the ground and everyone enjoys a tasty apple.",
              "You hear a cry of help from the tree.",
              "A greedy llama, wanting more apples had tried to climb the tree.",
              "But unlike humans, he only has four feet and no arms.",
              "His hind leg gets caught in some foliage and he loses his balance.",
              "He tumbles down the tree and you close your eyes as you hear a big thud."
          ]
        }
      ],
      "options": [
          {
            "text": "Scold the llama",
            "link": "outcome1"
          },
          {
            "text": "Help the llama",
            "link": "outcome2"
          }
      ]
    },
    {
      "id": "outcome1",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You scold the llama for being impatient and irresponsible.",
              "He does not take kindly to you tone lashes out against you:",
              "\"You're not my dad! You can't tell me what to do. I never wanted to be in this herd anyway!\"",
              "Despite your best efforts, you're not able to calm him down.",
              "To avoid further argument and lost time, the herd continues on the journey without him.",
              "Lose 1 llama, gain food."
          ],
          "triggers": [
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "food",
                "amount": 10
              }
            },
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "herdSize",
                "amount": -1
              }
            }
          ]
        }
      ]
    },
    {
      "id": "outcome2",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You calmly tell him that he should not have done what he did and help him up.",
              "The rest of the herd can barely contain their laughter.",
              "You tell them to keep it down while you try to tend to the llama's wounds.",
              "Gain food, lose health."
          ],
          "triggers": [
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "food",
                "amount": 10
              }
            },
            {
              "type": "statisticUpdate",
              "args": {
                "statistic": "health",
                "amount": -5
              }
            }
          ]
        }
      ]
    }
  ]
}