{
  "assets": [
    
  ],
  "characters": [
    {

    },{
        
    }
  ],
  "conversations": [
    {
      "id": "intro",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You feel like you’ve been walking for days without end, even though you’ve only just started your journey.",
              "There is nothing around you but the seemingly endless plain that extends to the horizon.",
              "You’ve arrived at the Salar de Uyuni in Bolivia, the largest salt flat in the world. ",
              "Occasionally you pass small piles of salt, the tiniest indication of landmarks in the otherwise featureless, cracked dirt.",
              "Everyone begins to wonder if the herd is lost.",
              "Suddenly, you see something glittering brightly up ahead.",              
              "As the herd approaches, you begin to make out a small hill in the distance.",
              "The herd picks up the pace in hopes of finding some fragment of civilization in the barren wasteland."
          ],

          "options": [
          {
            "text": "",
            "link": "scene1"
          }
          ]
        }
      ]
    },
    {
      "id": "scene1",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "The herd finds itself in front of Isla Incahuasi, a small rest stop on a rocky outcropping in the middle of the salt flats.",
              "A few stone buildings lay scattered across the island; you spot a tourist center among them, and the herd strolls in.",
              "While everyone else enjoys themselves for a bit, you decide to try and stock up on supplies.",
              "You take all of the wool accumulated from your trip down the mountains and, together with the leftover food, trade it in for oilcake.",
              "Hopefully it will be enough to sustain your herd for the long journey ahead.",
              "Do you want to stay and enjoy the sights?"
          ],
          "options": [
          {
            "text": "Yes",
            "link": "facts"
          },
          {
            "text": "No",
            "link": "leave"
          }
        ],
          "triggers": [
            {
              "type": "destinationUpdate",
              "args": {}
            }
          ]
        }
      ]
    },
    {
      "id": "facts",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "You find the rest of your herd waiting in line for the tour and decide to join them.",
              "Through the museum tour, you learn that the Salar de Uyuni is 10 kilometers squared, and someone jokes that it feels much larger than that when you’re walking."
              "The guide explains that the salt flats mainly produce lithium, and that they also serve as a breeding ground for different species of pink flamingos.",
              "The flats are the remains of various desert lakes, the water that remains there today is still around because it has no drainage routes.",
              "Isla Incahuasi was once an island within these desert lakes, but as the water dried up, became a small hill. ",
              "As the tour comes to an end, the herd picks up some souvenirs at the gift shop and babble about all of the cool salt facts they’ve learned."
          ]
        }
      ]
    },
    {
      "id": "leave",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "After a much-needed break from life on the road, the herd gathers outside the tourist center.",
              "You take this opportunity to make sure everyone goes to the bathroom and set out once again."
          ]
        }
      ]
    }
  ]
}
