{
  "assets": [],
  "characters": [],
  "conversations": [
    {
      "id": "intro",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "The flats turned to hills, and the hills turned to mountains.",
              "Large swaths of rocky outcrops bar your way, forcing you to climb your way forward.",
              "As you're climbing it, you start to notice ruins atop the crest.",
              "You've arrived at Machu Picchu, the once lost city of the Incans.",
              "There isn't much happening here right now, but you see curators working on restoring the crumbled buildings.",
              "You see a sign directing tourists towards the entrance.",
              "Do you want to stay and take a tour?"
          ],
          "triggers": [
            {
              "type": "destinationUpdate",
              "args": {}
            }
          ]
        }
      ],
          "options": [
          {
            "text": "Yes",
            "link": "facts"
          },
          {
            "text": "No",
            "link": "leave"
          }
        ]
    },
    {
      "id": "facts",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "One of the curators begins the tour.",
              "The guide passes out Inca Kola, a yellow-coloured soft drink iconic to Peru, courtesy of the tour.",
              "As everyone sips on the sweet beverage, she takes you through the city, passing several broken structures scattered throughout.",
              "She mentions that Machu Picchu means 'Old Peak', and is part of the New7Wonders of the World.",
              "You learn that the city was built by the Incas around 1450, only to be abandoned a century later, following the Spanish conquest of South America."
          ]
        }
      ],
          "options": [
          {
            "text": "",
            "link": "facts1"
          }
        ]
    },
    {
      "id": "facts1",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
	      "A few llamas yelp as a brightly coloured blur of feathers whirs pass you.",
              "The guide explains that it was an Andean Cock-of-the-Rock, the national bird of Peru.",
              "Before you know it, the tour comes to an end." 
          ]
        }
      ],
          "options": [
          {
            "text": "",
            "link": "leave"
          }
        ]
    },
    {
      "id": "leave",
      "dialogue": [
        {
          "speaker": "Speaker 1",
          "text": [
              "you take a quick selfie as a keepsake.",
              "As cool as the city was, you realize that this isn't the Place of Divination.",
              "You decide to stock up on supplies, taking all of the wool accumulated from your trip and trade it with the locals for some flour.",
              "(Food and Health refilled, Wool emptied)",
              "You continue your northward march through the mountain range."
          ]
        }
      ]
    }
  ]
}
